Repository: LordChunk/Bumbo
Catalog: Bumbo.Web/Resources/Views/ForecastStandard/Index.*.resx
Languages: nl

source: Manage Global Forecast Norms
nl: Beheer systeembrede prognose waardes

source: Here you can manage the forecast norms for all branches
nl: Hier beheert u de prognose waardes voor alle filialen

source: Create New
nl: Maak nieuwe waarde aan

source: Activity
nl: Activiteit

source: Value
nl: Waarde

source: Edit
nl: Aanpassen

source: CASHIER
nl: Kassa

source: FACE_SHELVES
nl: Spiegelen

source: PRODUCE_DEPARTMENT
nl: Vers

source: Save
nl: Opslaan

source: STOCK_SHELVES
nl: Vakkenvullen

source: UNLOAD_COLI
nl: Coli uitladen
